<div class="blog">
    <div class="container">

        <h1>Основы Docker за Х часов и Y дней</h1>
        <h5>Виртуализация,DevOps Из песочницы</h5>
        <h3>Вступление</h3>

        <p>Цель данной статьи собрать в небольшую кучку основную информацию, минимально достаточную для того, чтобы
            начать работать
            с докер на ежедневной основе и удалить с рабочей машины локально установленные apache, mysql,
            virtualenv, python3,
            mongodb, memchaced, redis, php5, php7 и весь остальной зоопарк, который мы используем при разработке, и
            который зачастую
            еще и конфликтует между собой от версии к версии.</p>

        <p>А еще я в автобусе и ближайшие 7 часов мне все равно делать будет нечего. Ну и вдобавок я наконец-то
            соберу в одном месте
            ссылки и команды, за которыми мне самому периодически приходится лезть в документацию, например — как на
            маке добавить IP
            алиас к локалхосту: sudo ifconfig lo0 alias 10.200.10.1/24 (зачем это надо будет сказано позже)</p>

        <p>Статья называется так, как называется, потому что я не смог более-менее точно подсчитать сколько нужно
            времени на
            поставленную задачу. У меня на это ушло примерно 6 часов в течение 3 дней. Во многом, потому что в тот
            момент я работал
            фулл тайм в офисе и осваивал докер, так сказать, без отрыва от производства.</p>

        <p>У вас может уйти меньше дней или больше часов, зависит от того, как интенсивно вы будете вникать.</p>

        <p>Но мое личное мнение – лучше все же не пытаться “ворваться” за один день. Просто потому что если Вы
            никогда не имели с
            этим дело, то в конце первого дня у вас будет где-то вот такая голова</p>
        <p>И лучше в этот момент остановиться, переварить информацию, может даже поспать.</p></div>
</div>
